In [150]:
import numpy as np 
import pandas as pd 
from numpy.random import randn 
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [151]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

COMDITIONAL SELECTION

In [152]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [153]:
bool_df=df>0

In [154]:
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

WE CAN SAVE THE FILTERED CONDITION INTO A VARIABLE USE IT TO RETRIEVE THE SATISFIED DATA

In [155]:
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

WE CAN DIRECTLY PUT CONDITION INSIDE THE DATAFRAME ALSO

In [156]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

ANOTHER TYPE OF CONDITIONALING CAN BE

In [157]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [158]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

SIMILIAR TO NUMPY WE CAN ADD CONDITIONS INSIDE THE BRACKETS

In [159]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

HERE DUE TO ONGOING CONDITION THE ROW C IS COMPLETELY TERMINATED

In [160]:
df[df["W"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [161]:
result_df=df[df['W']>0]

In [162]:
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [163]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

INSTEAD OF WRITING SO MUCH PF CODE WE CAN COMPACT IT

In [164]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

FOR SELECTION OF MULTIPLE COULMNS WE NEED TO SEND *LIST IN LIST*

In [165]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

FOR MULTIPLE CONDITIONS

THIS CODE WILL GIVE ERROR SINCE HERE WE CANNOT USE and, or OPERATOR

In [166]:
##df[df['W']>0 and df['X']<1]

TO CONQUER THIS SITUATION WE USE &,| SYMBOLS FOR AND,OR

ALSO REMEMBER TO ADD *PARENTHESIS ()* TO EACH CONDITION

In [167]:
df[(df['W']>0) & (df['X']<1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [168]:
df[(df['W']>0) | (df['X']<1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

INDEX RESETTING

TO RESET THE INDEX WE USE .reset_index() METHOD

BY DEFAULT IT WILL NOT EDIT THE ORIGINAL DATAFRAME

TO EDIT ORIGINAL DATAFRAME SET inplace=True

In [169]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [170]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [171]:
df.reset_index(inplace=True)

In [172]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [173]:
new_index='MP UP MH RJ HP'.split()

In [174]:
new_index

['MP', 'UP', 'MH', 'RJ', 'HP']

In [175]:
df['STATES']=new_index

In [176]:
df

  index         W         X         Y         Z STATES
0     A  2.706850  0.628133  0.907969  0.503826     MP
1     B  0.651118 -0.319318 -0.848077  0.605965     UP
2     C -2.018168  0.740122  0.528813 -0.589001     MH
3     D  0.188695 -0.758872 -0.933237  0.955057     RJ
4     E  0.190794  1.978757  2.605967  0.683509     HP

In [177]:
df.set_index('STATES',inplace=True)

In [178]:
df

       index         W         X         Y         Z
STATES
MP         A  2.706850  0.628133  0.907969  0.503826
UP         B  0.651118 -0.319318 -0.848077  0.605965
MH         C -2.018168  0.740122  0.528813 -0.589001
RJ         D  0.188695 -0.758872 -0.933237  0.955057
HP         E  0.190794  1.978757  2.605967  0.683509